#### Question 1: Given some sample data, write a program to answer the following: click here to access the required data set
On Shopify, we have exactly 100 sneaker shops, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $3145.13. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis.

**1. Think about what could be going wrong with our calculation. Think about a better way to evaluate this data.**

In [1]:
import pandas as pd
import numpy as np

df = pd.read_excel('dataset.xlsx')
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56.190
1,2,92,925,90,1,cash,2017-03-03 17:38:51.999
2,3,44,861,144,1,cash,2017-03-14 04:23:55.595
3,4,18,935,156,1,credit_card,2017-03-26 12:43:36.649
4,5,18,883,156,1,credit_card,2017-03-01 04:35:10.773

In [2]:
df.sort_values(by=['order_amount'], ascending=False).head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
2153,2154,42,607,704000,2000,credit_card,2017-03-12 04:00:00
3332,3333,42,607,704000,2000,credit_card,2017-03-24 04:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 04:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 04:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 04:00:00

In [3]:
df['avg_price_per_item'] = df['order_amount'] / df['total_items']
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_price_per_item
0,1,53,746,224,2,cash,2017-03-13 12:36:56.190,112.0
1,2,92,925,90,1,cash,2017-03-03 17:38:51.999,90.0
2,3,44,861,144,1,cash,2017-03-14 04:23:55.595,144.0
3,4,18,935,156,1,credit_card,2017-03-26 12:43:36.649,156.0
4,5,18,883,156,1,credit_card,2017-03-01 04:35:10.773,156.0

In [4]:
df.sort_values(by=['avg_price_per_item'], ascending=False).head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_price_per_item
4420,4421,78,969,77175,3,debit,2017-03-09 15:21:34.551,25725.0
2906,2907,78,817,77175,3,debit,2017-03-16 03:45:46.089,25725.0
4505,4506,78,866,25725,1,debit,2017-03-22 22:06:00.804,25725.0
493,494,78,983,51450,2,cash,2017-03-16 21:39:35.400,25725.0
2452,2453,78,709,51450,2,cash,2017-03-27 11:04:04.363,25725.0

There appears to be some outliers (and possibly suspicious activities) in the dataset.

For this particular case, the average price of a sneaker is \\$25,725 for *shop_id=78*, and the total number of items for 17 orders with *shop_id=42* is 2,000, which might not seem reasonable. A better way to evaluate this data will require some data preprocessing -- for example, **to remove those outliers** and drop them before we perform the analysis. Since the problem already stated that we know sneakers are relatively affordable, a naive approach to do so might be to set a bar for the average price of an item and number of items per order to be considered.

In [5]:
# Function to preprocess the data based on the price bar and amount bar
def preprocess_data(df, price_bar, amount_bar):
    df['avg_price_per_item'] = df['order_amount'] / df['total_items']
    df_filtered = df[df['avg_price_per_item'] <= price_bar] # filter by the price bar
    df_filtered = df_filtered[df_filtered['total_items'] <= amount_bar] # filter by the amount per order
    return df_filtered

In [6]:
df_preprocessed = preprocess_data(df, 360.0, 1000) # Some arbitrary bar for the function demo

In [7]:
df_preprocessed.sort_values(by=['avg_price_per_item'], ascending=False).head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_price_per_item
1364,1365,42,797,1760,5,cash,2017-03-10 06:28:21.039,352.0
834,835,42,792,352,1,cash,2017-03-25 21:31:24.596,352.0
1512,1513,42,946,352,1,debit,2017-03-24 13:35:04.115,352.0
2018,2019,42,739,352,1,debit,2017-03-01 12:42:25.759,352.0
4294,4295,42,859,704,2,cash,2017-03-24 20:50:39.607,352.0

In [8]:
df_preprocessed['order_amount'].mean()

302.58051448247926

As one may see, by removing the outliers and cleaning the data, we can get a more reasonable AOV, at \\$302.58 per order. However, AOV may not be the best option in this case, as I'm explaining in my answers down below.

**2. What metric would you report for this dataset?**

**3. What is its value?**

(To answer question 2 and 3) In addition to preprocessing the data, a better metric in this case would be to use the **median order value** without having to worry about the outliers (Although in real world cases, we should still handle them!). This is because the median value is generally not affected by outliers in a normal distribution. If we were to use the median order value as the metric, we'll get **\\$284 per order**.

In [9]:
df['order_amount'].median()

284.0

In [10]:
df_preprocessed['order_amount'].median()

284.0

We can see that using the median order value on the un-preprocessed and preprocessed dataset both yields \\$284 per order :)

---

#### Question 2: For this question youâ€™ll need to use SQL. Follow this link to access the data set required for the challenge. Please use queries to answer the following questions. Paste your queries along with your final numerical answers below.
**1. How many orders were shipped by Speedy Express in total?**

In [ ]:
SELECT COUNT(OrderID) 
FROM Orders INNER JOIN Shippers ON Orders.ShipperID=Shippers.ShipperID 
WHERE Shippers.ShipperName="Speedy Express"

**54 orders** were shipped by Speedy Express in total.

My thought is to simply join the "Orders" table with the "Shippers" table and count the number of orders where the shipper name equals to "Speedy Express".

**2. What is the last name of the employee with the most orders?**

In [ ]:
SELECT LastName, COUNT(LastName) AS 'EmployeeOccurrence'
FROM Employees INNER JOIN Orders ON Employees.EmployeeID=Orders.EmployeeID 
GROUP BY LastName 
ORDER BY COUNT(LastName) DESC 
LIMIT 1

**Peacock** was the last name of the employee with the most orders, with 40 orders to handle.

My approach to the problem is to join the "Employees" table with the "Orders" table, group the entries by the employees' last name, count the last names and order by descending order, and finally using "LIMIT 1" to select the employee with the most orders. Please note that "COUNT(LastName) AS 'EmployeeOccurrence'" is not really required, but only used for my own debugging.

**3. What product was ordered the most by customers in Germany?**

In [ ]:
SELECT ProductName, SUM(Quantity) AS 'TotalQuantity'
FROM Orders
LEFT JOIN Customers ON Orders.CustomerID=Customers.CustomerID 
LEFT JOIN OrderDetails ON Orders.OrderID=OrderDetails.OrderID
LEFT JOIN Products ON OrderDetails.ProductID=Products.ProductID
WHERE Country='Germany'
GROUP BY OrderDetails.ProductID 
ORDER BY SUM(Quantity) DESC
LIMIT 1

**Boston Crab Meat** was ordered the most by customers in Germany, at 160 in total quantity.

My thought process is to left join the 'Orders' table with 'Customers', 'OrderDetails', and 'Products' in the order, and this will give me a joined table with all the columns I need. Then, from the joined table, I select the entries in which the customer country is Germany, group them by product ID and order the products based on the sum of order quantity in descending order. By limiting the selected entry to 1 with "LIMIT 1", a trick which I used for the previous problem, I'm able to query the product that was ordered the most by German customers.